const news= document.createElement('template');

newsStyles = `
    <style>
        section{
            word-break : break-word;
        }
        p{
            font-size : 13px;
            text-align : justify;
            padding : 5px 10px;
        }
    </style>
`

news.innerHTML = `
    ${newsStyles}
    <section>
        <p>
        ه گزارش خبرنگار خبرگزاری شبستان از اصفهان، «جلال ریزانه» در نشست با مدیران مسئول مناطق شهر اصفهان به موضوع منابع مالی کانون های فرهنگی و هنری مساجد اشاره کرد و اظهارداشت: ایجاد درآمد پایدار برای این کانون ها از سه روش بودجه های دولتی، برنامه های تولیدی کانون های مساجد و منابع توسعه ای در دستور کار است.

 

        معاون پشتیبانی و توسعه منابع ستاد فهما افزود: تولید بر پایه کارآفرینی  نقطه عطف درآمد پایدار برای کانون های فرهنگی و هنری مساجد است که بسیاری از مدیران کانون ها از این محل درآمدزایی و تامین اعتبار می کنند.
        
        وی ادامه داد: کانون های مساجد با تدوین برنامه ای متناسب با ظرفیت خود باید منابع پایداری ایجاد کنند که توجه به فعالیت های کارآفرینی و مدل های نوین در این خصوص نقش اساسی دارد.
        
         
        
        ریزانه با اشاره به اینکه مصرف و هزینه بودجه نیز به اندازه تامین درآمد مهم است، تصریح کرد: چگونگی هزینه که منجر به جلب اعتماد و کسب کمک های مردمی و دولتی بشود اهمیت دارد که از این رو مدیران کانون ها نسبت این اصل مهم توجه داشته باشند.
        
        وی یادآورشد: باید مدل های موفق را بدست آوریم و برنامه ریزی برای اجرای آن داشته باشیم و با چنین طرح هایی به دیگر مراکز نیز راه و روش صحیح ارائه دهیم.
        
         
        
        معاون پشتیبانی و توسعه منابع ستاد فهما با اشاره به وضعیت نابسمان اقتصادی کشور، خاطرنشان کرد: دولت وضعیت بودجه ای خوبی ندارند و امکان جلب بودجه زیاد نیست و نباید وابسته به این حوزه بشویم.
        
         
        
        *مردمی سازی فرهنگ و هنر با ظرفیت کانون های مساجد
        
         
        
        وی به فعالیت دولت جدید و رویکرد مردمی آن اشاره کرد و اذعان داشت: یکی از دغدغه های جدی دولت در حوزه فرهنگ و هنر، مردمی کردن آن است که به اذعان وزیر فرهنگ و ارشاد اسلامی در نشست با مدیران ستادی و استانی کانون های مساجد کشور، تنها ظرفیت فعال همین کانون های فرهنگی و هنری مساجد هستند.
        
        ریزانه استفاده از ظرفیت کانون های مساجد برای دستیابی به اهداف فرهنگی و هنری دولت در راستای مردمی سازی آن را مهم برشمرد و گفت: مدیران و تیم اجرایی کانون های مساجد در این حوزه نقش خود را ایفا کنند.
        
        وی به همت و تلاش وزارت فرهنگ و ارشاد اسلامی برای حمایت از کانون های مساجد در دولت جدید خبرداد و یادآورشد: واقعیت های کانون های مساجد به اطلاع رئیسی جمهور خواهد رسید.
        
         
        
        *ضرورت تاسیس وزارت مسجد
        
         
        
        معاون ستاد کانون های فرهنگی و هنری مساجد بر ضرورت تاسیس وزارت مسجد در کشور خبرداد و گفت: چنین اقدامی موجب هم افزایی و ایجاد مسیر مناسب برای انجام کارهای فرهنگی در کشور خواهد شد و از اتلاف منابع در بین دستگاه های مختلف جلوگیری می شود.
        
        وی اضافه کرد: اگر در ادوار گذشته این مهم محقق شده بود دستاوردهای زیادی را امروز در حوزه فرهنگ و هنر شاهد بود و پراکنده کاری را نداشتیم.
        
        ریزانه بر عزم و اراده دولت جدید در این خصوص اشاره کرد و اذعان داشت: کمسیون فرهنگی مجلس شورای اسلامی و دولت در این خصوص هم نظر بوده و امکان رقم خوردن آن وجود دارد.
        </p>
    </section>
`

class News extends HTMLElement{
    constructor(){
        super();

        this.attachShadow({mode : 'open'});
        this.shadowRoot.appendChild(news.content.cloneNode(true));
    }
}

window.customElements.define('news-co',News);